import { ContainerFooterPagesStyle } from "../../styles/components";

const About = () => {
    return (
        <ContainerFooterPagesStyle>
            <h2>Про нас</h2>
            <p>
                Ласкаво просимо до мого веб-сайту!<br />
                Мене звати Сергій, і я є Front-end розробником з досвідом у створенні сайтів на різноманітні теми. Моя місія - допомогти вам втілити ваші ідеї в інноваційні та захоплюючі веб-проекти.
                Я завжди відкритий до нових та захоплюючих проектів і готовий до співпраці з вами. Незалежно від того, чи вам потрібен сайт для особистого користування, бізнесу чи будь-якого іншого завдання, я готовий допомогти вам зробити вашу ідею реальністю. Не соромтеся зв'язатися зі мною, і ми разом зробимо щось велике!
            </p>
        </ContainerFooterPagesStyle>
    )
};

export default About;