import { ContainerHomeStyle } from "./Home.styles";

const Home = () => {
    return (
        <ContainerHomeStyle>
            <h2>Вивчення англійської мови</h2>
            <p><strong>Сторінка сайту призначена для вивчення англійських слів та має наступні можливості:</strong></p>
            <p>
                <b>Словник</b> : На сторінці розміщено словник, що містить 3234 слова з їх перекладом.<br />
                <b>Додавання до вибраних</b> : Користувач може додавати слова зі словника до розділу "Вибрані". Слова, які додані до вибраних, відзначаються як неактивні у словнику і відображаються іншим кольором, щоб користувач міг швидко розрізнити їх від інших слів.<br />
                <b>Додавання до вивчених</b> : Користувач може додавати слова зі словника до розділу "Вивчені", якщо він вже знає їх. Після додавання слова до вивчених, воно автоматично видаляється зі словника.<br />
                <b>Подальша робота зі словами</b> : Користувач може працювати зі словами, які він додав до вибраних або вивчених, на окремих панелях. Наприклад, він може вивчати слова з розділу "Вибрані", після вивчення перемістити їх до розділу "Вивчені". У розділі "Вивчені" він може повторити вивчені слова або повернути їх назад до словника.<br />
                <b>Зберігання</b> : Весь прогрес користувача зберігається до видалення їх акаунту.<br /><br />
                Такий функціонал дозволяє користувачам ефективно організовувати процес вивчення англійських слів, надаючи зручні інструменти для відстеження їх прогресу та роботи зі словами. Цей сервіс є безкоштовним, але для збереження прогресу необхідна реєстрація.<br /><br />
                <i>Це тестова версія сайту для вивчення англійських слів. У майбутньому планується розширення функціоналу, включаючи додавання нових словникових слів, форм, та інші корисні інструменти для ефективного вивчення мови. Будь ласка, залишайтеся з нами і очікуйте нових оновлень!</i>
            </p>
        </ContainerHomeStyle>
    )
};

export default Home;